class CardCategory {
  final String name;
  final String imgPath;
  final List<String> imgList;
  CardCategory({
    required this.name,
    required this.imgPath,
    required this.imgList,
  });
}

abstract class CategoryList {
  static List<CardCategory> items = [
    CardCategory(name: 'геометрические фигуры', imgPath: '', imgList: ['восьмиугольник','звезда','квадрат','крест','круг','овал','параллелограмм','полукруг','прямоугольник','пятиугольник','ромб','семиугольник','сердце','трапеция','треугольник','шестиугольник']),
    CardCategory(name: 'животные', imgPath: '', imgList: ['бегемот','белка','белый медведь','бобр','бурундук','верблюд','волк','гадюка','гепард','гиена','еж','енот','жираф','заяц','зебра','зубр','кабан','кенгуру','коала','кобра','козел','корова','косуля','кот','крокодил','крыса','лама','лев','леопард','лиса','лошадь','лягушка','медведь','морж','морская свинка','мышь','носорог','овца','олень','орангутанг','осел','панда','пантера','питон','пони','рысь','свинья','скунс','слон','собака','тигр','тюлень','хамелеон','хомяк','хорек','черепаха','шимпанзе','шиншилла','ящерица']), 
  ];
}
